CIVIL_MOTIVATION_TEMPLATE = (
    "1.1 Ключове питання, яке постало перед судом у цій справі:\n\n"
    "1.2 Джерела права, які підлягають застосуванню при ухваленні судового рішення:\n\n"
    "1.3 Мотивована оцінка аргументів, наведених учасниками справи, щодо наявності чи відсутності підстав "
    "для задоволення позову із посиланням на норми права, які застосував/не застосував суд, "
    "та мотиви їх застосування/не застосування:\n\n"
    "1.4 Висновок, чи були і ким порушені, не визнані або оспорені права чи інтереси, "
    "за захистом яких мало місце звернення до суду, та мотиви такого висновку:\n\n"
    "1.5 Висновок про те, яке судове рішення слід ухвалити за результатом розгляду справи:\n\n"
    "1.6 Висновок про те, як слід здійснити розподіл судових витрат:\n"
)

CIVIL_RESOLUTION_TEMPLATE = (
    "2.1 Висновок суду про задоволення позову чи про відмову в позові повністю або частково "
    "щодо кожної із заявлених вимог:\n\n"
    "2.2 Розподіл судових витрат:\n\n"
    "2.3 Строк і порядок набрання рішенням суду законної сили та його оскарження:\n\n"
    "2.4 Повне прізвище, ім’я та по батькові сторін, їх місце проживання чи перебування, "
    "ідентифікаційний номер облікової картки платника податків сторін, за його наявності, або номер і серія паспорта "
    "для фізичних осіб - громадян України:\n"
)
