[
  {
    "number": 1,
    "text": "У будинку створено об’єднання співвласників. Загальні збори відбуваються двічі на рік: у березні та вересні. Кворум вважається наявним, якщо присутні більше половини співвласників. Рішення приймаються простою більшістю голосів від присутніх. Якщо кворуму немає, збори переносяться на інший день, і тоді рішення можуть прийматися будь-якою кількістю присутніх. Запитання: Що станеться, якщо у вересні на збори прийшло 40% співвласників?",
    "difficulty": "easy",
    "score": "1.22",
    "answers": [
      {
        "text": "A) Збори проведуть і ухвалять рішення."
      },
      {
        "text": "B) Збори проведуть, але рішення недійсні."
      },
      {
        "text": "C) Збори перенесуть.",
        "is_correct": true
      },
      {
        "text": "D) Збори не проводяться у вересні."
      }
    ]
  },
  {
    "number": 2,
    "text": "У готелі діє правило: розрахунковий час — 12:00. Якщо гість залишає номер пізніше, ніж на 2 години після цього часу, він сплачує половину добової вартості. Якщо більше ніж на 6 годин — сплачує повну добову вартість. Виключення можливе лише у разі попередньої домовленості з адміністрацією. Запитання: Що має сплатити гість, якщо він залишив номер о 18:30 без попередження?",
    "difficulty": "easy",
    "score": "1.22",
    "answers": [
      {
        "text": "A) Нічого."
      },
      {
        "text": "B) Половину добової вартості."
      },
      {
        "text": "C) Повну добову вартість.",
        "is_correct": true
      },
      {
        "text": "D) Подвійну добову вартість."
      }
    ]
  },
  {
    "number": 3,
    "text": "У міській бібліотеці є три відділи: дорослий, дитячий та електронних ресурсів. Читач може користуватися всіма відділами, але для доступу до електронних ресурсів потрібно оформити окрему картку. Картка видається безкоштовно, але лише повнолітнім користувачам. Запитання: Хто зможе скористатися електронними ресурсами?",
    "difficulty": "easy",
    "score": "1.22",
    "answers": [
      {
        "text": "A) Будь-який читач."
      },
      {
        "text": "B) Лише той, хто має окрему картку.",
        "is_correct": true
      },
      {
        "text": "C) Лише діти."
      },
      {
        "text": "D) Тільки користувачі дитячого відділу."
      }
    ]
  },
  {
    "number": 4,
    "text": "Згідно з інструкцією, побутовий прилад можна використовувати лише у приміщеннях із температурою від +5°C до +35°C. Якщо температура нижча або вища, виробник не гарантує безпеку роботи. Також заборонено накривати прилад тканиною чи ставити його близько до стін. Запитання: У якій ситуації використання приладу не відповідає інструкції?",
    "difficulty": "easy",
    "score": "1.22",
    "answers": [
      {
        "text": "A) У приміщенні з температурою +20°C."
      },
      {
        "text": "B) Коли прилад стоїть посеред кімнати."
      },
      {
        "text": "C) Коли прилад накрили тканиною.",
        "is_correct": true
      },
      {
        "text": "D) Коли температура +25°C."
      }
    ]
  },
  {
    "number": 5,
    "text": "На виробництві встановлено три зміни: перша — з 6:00 до 14:00, друга — з 14:00 до 22:00, третя — з 22:00 до 6:00. Працівники змінюються через турнікет, який відкривається автоматично рівно в час початку зміни. Запізнення більше ніж на 15 хвилин вважається прогулом. Запитання: Що станеться, якщо працівник прийде на роботу о 14:20?",
    "difficulty": "easy",
    "score": "1.22",
    "answers": [
      {
        "text": "A) Він потрапить на роботу, але без оплати."
      },
      {
        "text": "B) Це вважається прогулом.",
        "is_correct": true
      },
      {
        "text": "C) Він працюватиме у третю зміну."
      },
      {
        "text": "D) Його впустять після пояснювальної записки."
      }
    ]
  },
  {
    "number": 6,
    "text": "Залізнична каса працює щодня з 8:00 до 20:00. Квитки можна придбати онлайн у будь-який час, але повернути квиток онлайн можна лише до моменту відправлення поїзда. Якщо квиток куплено в касі, повернути його можна тільки в касі в робочі години. Запитання: Коли можна повернути квиток, куплений у касі, якщо поїзд відправляється о 21:00?",
    "difficulty": "easy",
    "score": "1.22",
    "answers": [
      {
        "text": "A) До 20:00.",
        "is_correct": true
      },
      {
        "text": "B) До 21:00."
      },
      {
        "text": "C) У будь-який час."
      },
      {
        "text": "D) Лише онлайн."
      }
    ]
  },
  {
    "number": 7,
    "text": "На факультеті іноземних мов проводиться два види іспитів: письмовий та усний. Студенти, які не здали письмовий, до усного не допускаються. Якщо студент отримав незадовільну оцінку на усному іспиті, він має право на одну перескладання протягом місяця. Запитання: Хто буде допущений до усного іспиту?",
    "difficulty": "easy",
    "score": "1.22",
    "answers": [
      {
        "text": "A) Лише ті, хто склав письмовий.",
        "is_correct": true
      },
      {
        "text": "B) Усі студенти."
      },
      {
        "text": "C) Лише ті, хто провчився рік."
      },
      {
        "text": "D) Лише ті, хто отримав незадовільно."
      }
    ]
  },
  {
    "number": 8,
    "text": "У супермаркеті діє акція: при купівлі товарів на суму понад 500 грн покупець отримує знижку 10% на весь чек. Якщо покупець має картку постійного клієнта, він отримує додатково ще 5% знижки. Знижки підсумовуються. Запитання: Яку знижку отримає власник картки, якщо його покупка склала 600 грн?",
    "difficulty": "easy",
    "score": "1.22",
    "answers": [
      {
        "text": "A) 5%"
      },
      {
        "text": "B) 10%"
      },
      {
        "text": "C) 15%",
        "is_correct": true
      },
      {
        "text": "D) Жодної"
      }
    ]
  },
  {
    "number": 9,
    "text": "Відповідно до правил перевезення багажу в автобусі, пасажир може безкоштовно перевозити сумку до 30×40×60 см. Якщо багаж перевищує ці розміри, пасажир має придбати багажний квиток. Кількість багажних місць, які можна провезти за один квиток, обмежується однією одиницею. Запитання: Що має зробити пасажир із валізою розміром 35×45×65 см?",
    "difficulty": "easy",
    "score": "1.22",
    "answers": [
      {
        "text": "A) Провезти безкоштовно."
      },
      {
        "text": "B) Придбати багажний квиток.",
        "is_correct": true
      },
      {
        "text": "C) Розділити валізу на дві частини."
      },
      {
        "text": "D) Віддати валізу водієві."
      }
    ]
  },
  {
    "number": 10,
    "text": "У гуртожитку встановлено правила користування кухнею: приготування їжі дозволено з 6:00 до 23:00. Якщо студент залишив увімкнену плиту після цього часу, черговий має право скласти акт і повідомити адміністрацію. Після трьох актів студент може бути позбавлений права користування кухнею на місяць. Запитання: Що станеться, якщо студент тричі залишить плиту ввімкненою після 23:00?",
    "difficulty": "easy",
    "score": "1.22",
    "answers": [
      {
        "text": "A) Його виселять з гуртожитку."
      },
      {
        "text": "B) Його оштрафують."
      },
      {
        "text": "C) Його позбавлять права користуватися кухнею на місяць.",
        "is_correct": true
      },
      {
        "text": "D) Йому зроблять лише усне зауваження."
      }
    ]
  },
  {
    "number": 11,
    "text": "Згідно з умовами користування бібліотекою, кожен читач може одночасно взяти не більше 5 книжок строком на 14 календарних днів. У разі прострочення повернення застосовується штраф — 2 грн за кожен день прострочки за кожну книжку. Якщо читач загубив книжку, він зобов’язаний відшкодувати її вартість або замінити аналогічним виданням. У випадку, коли читач заздалегідь попередив бібліотеку про неможливість повернення книжки вчасно, йому може бути продовжено строк користування ще на 7 днів без штрафу. Запитання: Що станеться, якщо читач узяв 5 книжок, але вчасно повернув лише 3, а дві затримав на 4 дні?",
    "difficulty": "medium",
    "score": "1.55",
    "answers": [
      {
        "text": "A) Він нічого не сплатить."
      },
      {
        "text": "B) Він сплатить штраф у 8 грн."
      },
      {
        "text": "C) Він сплатить штраф у 16 грн.",
        "is_correct": true
      },
      {
        "text": "D) Йому автоматично продовжать строк ще на 7 днів."
      }
    ]
  },
  {
    "number": 12,
    "text": "У гуртожитку діє правило: гість може перебувати в кімнаті мешканця лише з 8:00 до 22:00. Якщо гість залишився після цього часу, мешканець повинен повідомити чергового та внести запис у спеціальний журнал. За порушення без повідомлення мешканця можуть попередити, а при повторному випадку — позбавити права приймати гостей на місяць. Запитання: Що буде, якщо мешканець двічі залишить гостя після 22:00 без повідомлення чергового?",
    "difficulty": "medium",
    "score": "1.55",
    "answers": [
      {
        "text": "A) Його зобов’яжуть виселитися з гуртожитку."
      },
      {
        "text": "B) Його позбавлять права приймати гостей на місяць.",
        "is_correct": true
      },
      {
        "text": "C) Йому зроблять ще одне попередження."
      },
      {
        "text": "D) Його оштрафують грошово."
      }
    ]
  },
  {
    "number": 13,
    "text": "Квиток на потяг може бути повернений не пізніше ніж за 6 годин до відправлення. У такому випадку пасажиру відшкодовується 90% вартості квитка. Якщо повернення відбувається менш ніж за 6 годин, але до моменту відправлення, пасажир отримує лише 50% від вартості. Після відправлення поїзда квитки не повертаються. Запитання: Що отримає пасажир, якщо здасть квиток за 3 години до відправлення?",
    "difficulty": "medium",
    "score": "1.55",
    "answers": [
      {
        "text": "A) Повне відшкодування вартості."
      },
      {
        "text": "B) 90% вартості."
      },
      {
        "text": "C) 50% вартості.",
        "is_correct": true
      },
      {
        "text": "D) Нічого."
      }
    ]
  },
  {
    "number": 14,
    "text": "На підприємстві діє графік роботи: понеділок–п’ятниця з 9:00 до 18:00 з обідньою перервою з 13:00 до 14:00. У вихідні дні (субота та неділя) робота не проводиться, крім випадків аварійних ситуацій. За роботу у вихідний працівнику надається або подвійна оплата, або інший вихідний день за його згодою. Запитання: Що отримає працівник, якщо він вийде на роботу в неділю через аварію?",
    "difficulty": "medium",
    "score": "1.55",
    "answers": [
      {
        "text": "A) Подвійну оплату або інший вихідний.",
        "is_correct": true
      },
      {
        "text": "B) Звичайну оплату."
      },
      {
        "text": "C) Жодної компенсації."
      },
      {
        "text": "D) Відрядження за рахунок підприємства."
      }
    ]
  },
  {
    "number": 15,
    "text": "Згідно з правилами авіакомпанії, пасажир має право провезти одну ручну поклажу вагою до 7 кг і одну одиницю зареєстрованого багажу вагою до 23 кг без додаткової оплати. Якщо вага ручної поклажі перевищує 7 кг, пасажиру необхідно здати її в багаж, а за перевищення ліміту багажу сплачується додаткова плата за кожен кілограм. У випадку, коли багаж перевищує 32 кг, його приймають лише як вантаж із додатковими умовами транспортування. Запитання: Що має зробити пасажир, якщо його валіза важить 35 кг?",
    "difficulty": "medium",
    "score": "1.55",
    "answers": [
      {
        "text": "A) Взяти її безкоштовно як зареєстрований багаж."
      },
      {
        "text": "B) Сплатити за 12 кг перевищення."
      },
      {
        "text": "C) Здати валізу як вантаж.",
        "is_correct": true
      },
      {
        "text": "D) Взяти частину у ручну поклажу."
      }
    ]
  },
  {
    "number": 16,
    "text": "Відповідно до правил проведення іспитів, студент допускається до складання лише за умови пред’явлення студентського квитка або іншого документа, що посвідчує особу. Якщо студент запізнився більш ніж на 30 хвилин, він не допускається до іспиту, незалежно від причин. Якщо студент був присутній на іспиті, але не склав його, він має право на одну перескладання протягом тижня. Запитання: Що станеться, якщо студент прийде на іспит без документів і запізниться на 40 хвилин?",
    "difficulty": "medium",
    "score": "1.55",
    "answers": [
      {
        "text": "A) Його допустять, але з попередженням."
      },
      {
        "text": "B) Його не допустять до іспиту.",
        "is_correct": true
      },
      {
        "text": "C) Йому дозволять скласти іспит, але без перескладання."
      },
      {
        "text": "D) Його допустять лише за письмовим дозволом викладача."
      }
    ]
  },
  {
    "number": 17,
    "text": "Відповідно до Порядку надання адміністративних послуг, суб’єкт звернення має право подати документи особисто, поштою або в електронній формі через офіційний веб-портал. У разі подання документів поштою датою прийняття вважається дата їх фактичного отримання відповідним органом. Якщо документи надійшли в електронній формі, датою прийняття вважається дата реєстрації заяви в системі. Документи, подані неналежним способом, повертаються заявнику без розгляду. Водночас, якщо документи подані у встановлений строк, але з технічними помилками, заявнику протягом двох робочих днів надсилається повідомлення з вимогою виправити недоліки, після чого надається додатковий строк у три робочі дні для їх усунення. Запитання: Що станеться, якщо заявник подав документи поштою у встановлений строк, але з технічною помилкою?",
    "difficulty": "hard",
    "score": "2.16",
    "answers": [
      {
        "text": "A) Документи будуть розглянуті без зауважень."
      },
      {
        "text": "B) Документи будуть повернуті заявнику без розгляду."
      },
      {
        "text": "C) Заявник отримає повідомлення про виправлення та додатковий строк.",
        "is_correct": true
      },
      {
        "text": "D) Датою прийняття вважатиметься дата відправлення документів."
      }
    ]
  },
  {
    "number": 18,
    "text": "Відповідно до Умов конкурсного відбору, учасники мають право подавати заявки у кількох категоріях з обмеженнями: (1) не більше 3 заявок загалом і не більше однієї в кожній категорії; (2) якщо подано заявку в \"Наукові дослідження\", обов’язково має бути ще одна у \"Соціальних проєктах\"; (3) якщо є заявка в \"Бізнес-ініціативи\", фінансування інших заявок зменшується на 20%; (4) дедлайн для \"Культури\" — до 1 червня, для інших — до 15 червня; (5) у разі конфлікту інтересів (член журі — керівник/співзасновник організації-заявника) всі заявки цієї організації відхиляються; (6) учасники до 21 року не можуть подавати заявки в \"Бізнес-ініціативи\" та \"Наукові дослідження\". Ситуація: 20-річний Андрій подав 3 заявки: у \"Культуру\" 2 червня, у \"Соціальні проєкти\", і у \"Наукові дослідження\" від імені студентського наукового гуртка, співзасновником якого є член журі. Запитання: Яка оцінка результату найточніша?",
    "difficulty": "hard",
    "score": "2.16",
    "answers": [
      {
        "text": "A) Усі три заявки прийняті, але фінансування скоротять на 20%."
      },
      {
        "text": "B) Прийняті лише заявки в \"Культурі\" та \"Соціальних проєктах\"."
      },
      {
        "text": "C) Усі заявки Андрія будуть відхилені через конфлікт інтересів.",
        "is_correct": true
      },
      {
        "text": "D) Буде прийнята лише заявка в \"Соціальних проєктах\", інші анулюють."
      }
    ]
  },
  {
    "number": 19,
    "text": "Відповідно до Статуту навчального закладу, учні мають право на академічну відпустку у разі тривалої хвороби або сімейних обставин. Для оформлення необхідно подати заяву та підтверджувальні документи. Рішення ухвалює педрада протягом 10 робочих днів. На час академвідпустки місце зберігається, а після повернення учень поновлюється без конкурсу. Якщо учень не повернувся протягом 12 місяців після надання академвідпустки, він автоматично втрачає право на поновлення, якщо інше не вирішено педрадою. Запитання: Які наслідки, якщо учень після 12 місяців не подав заяву на поновлення?",
    "difficulty": "hard",
    "score": "2.16",
    "answers": [
      {
        "text": "A) Його місце в закладі буде збережене."
      },
      {
        "text": "B) Він автоматично втрачає право на поновлення.",
        "is_correct": true
      },
      {
        "text": "C) Він зможе поновитися через конкурс."
      },
      {
        "text": "D) Він може продовжити відпустку без обмежень."
      }
    ]
  },
  {
    "number": 20,
    "text": "Згідно із законом про доступ до публічної інформації, розпорядники надають відповідь на запит не пізніше 5 робочих днів. Якщо запит стосується великого обсягу інформації або вимагає пошуку серед значної кількості даних, строк може бути продовжений до 20 робочих днів, про що заявника повідомляють не пізніше ніж через 5 робочих днів від дати надходження запиту. Відмова допускається лише у випадках, прямо передбачених законом, і має бути обґрунтована. Запитання: Що зобов’язаний зробити розпорядник, якщо для виконання запиту потрібно більше часу через великий обсяг даних?",
    "difficulty": "hard",
    "score": "2.16",
    "answers": [
      {
        "text": "A) Відмовити у задоволенні запиту."
      },
      {
        "text": "B) Надати відповідь не пізніше 5 днів у будь-якому випадку."
      },
      {
        "text": "C) Повідомити заявника про продовження строку до 20 днів.",
        "is_correct": true
      },
      {
        "text": "D) Надати лише частину інформації."
      }
    ]
  },
  {
    "number": 21,
    "text": "1) Усі студенти факультету права повинні скласти іспит з конституційного права. 2) Деякі студенти факультету права є стипендіатами. 3) Андрій — студент факультету права і отримує стипендію. Питання: Який висновок найбільш логічний?",
    "difficulty": "medium",
    "score": "1.55",
    "answers": [
      {
        "text": "A) Андрій складе іспит з конституційного права.",
        "is_correct": true
      },
      {
        "text": "B) Усі студенти-стипендіати складають іспит з конституційного права."
      },
      {
        "text": "C) Андрій не зможе скласти іспит, якщо втратить стипендію."
      },
      {
        "text": "D) Деякі стипендіати не є студентами факультету права."
      }
    ]
  },
  {
    "number": 22,
    "text": "Потрібно сформувати команду з чотирьох людей. Умови: (1) має бути щонайменше одна жінка; (2) Петро та Олексій не можуть бути разом; (3) якщо Марина у команді, обов’язково має бути й Оксана. Кандидати: Петро, Олексій, Дмитро, Марина, Оксана, Ірина. Питання: Який склад відповідає умовам?",
    "difficulty": "medium",
    "score": "1.55",
    "answers": [
      {
        "text": "A) Петро, Дмитро, Ірина, Марина."
      },
      {
        "text": "B) Олексій, Дмитро, Марина, Ірина."
      },
      {
        "text": "C) Петро, Дмитро, Марина, Оксана.",
        "is_correct": true
      },
      {
        "text": "D) Петро, Олексій, Марина, Ірина."
      }
    ]
  },
  {
    "number": 23,
    "text": "Щоб отримати банківський кредит, потрібно: (1) надати офіційне підтвердження доходу; (2) не мати прострочених боргів. Олег надав підтвердження доходу, але має прострочений борг. Марія не має боргів, але не змогла надати підтвердження доходу. Іван не має боргів і надав підтвердження доходу. Питання: Хто може отримати кредит?",
    "difficulty": "medium",
    "score": "1.55",
    "answers": [
      {
        "text": "A) Лише Олег."
      },
      {
        "text": "B) Лише Марія."
      },
      {
        "text": "C) Лише Іван.",
        "is_correct": true
      },
      {
        "text": "D) Іван та Марія."
      }
    ]
  },
  {
    "number": 24,
    "text": "Шестеро людей — Аліна (А), Богдан (Б), Віра (В), Гліб (Г), Денис (Д), Єва (Є) — сидять за круглим столом. Відомо, що: (1) Аліна сидить між Богданом та Вірою; (2) Гліб не може сидіти поруч із Богданом або Євою; (3) Денис сидить навпроти Віри; (4) Єва сидить не поруч з Аліною. Питання: Яке твердження обов’язково істинне за цих умов?",
    "difficulty": "hard",
    "score": "2.16",
    "answers": [
      {
        "text": "A) Богдан сидить поруч із Аліною, але не поруч із Глібом.",
        "is_correct": true
      },
      {
        "text": "B) Єва сидить поруч із Денисом."
      },
      {
        "text": "C) Віра сидить між Аліною та Євою."
      },
      {
        "text": "D) Гліб сидить навпроти Богдана."
      }
    ]
  },
  {
    "number": 25,
    "text": "Команда для технічного проєкту: потрібно 4 особи з кандидатів Карина (К), Лев (Л), Михайло (М), Олена (О), Павло (П), Роман (Р). Умови: (1) якщо є Карина, обов’язково є Олена; (2) Лев і Павло не можуть бути разом; (3) щонайменше одна жінка (Карина або Олена) у складі; (4) якщо є Роман, то має бути й Михайло; (5) рівно 4 особи. Питання: Який склад можливий?",
    "difficulty": "hard",
    "score": "2.16",
    "answers": [
      {
        "text": "A) Карина, Олена, Лев, Михайло"
      },
      {
        "text": "B) Карина, Лев, Павло, Роман"
      },
      {
        "text": "C) Олена, Лев, Михайло, Роман",
        "is_correct": true
      },
      {
        "text": "D) Карина, Олена, Павло, Роман"
      }
    ]
  },
  {
    "number": 26,
    "text": "Три презентації — X, Y, Z — треба провести у вівторок у слотах: 10:00–10:45, 11:15–12:00, 14:00–14:45. Обмеження: (1) X не може виступати раніше 11:15; (2) Y має бути перед Z; (3) якщо Y у першому доступному для неї слоті (10:00), тоді між Y та Z рівно один слот; (4) Z не може бути о 14:00–14:45, якщо X стоїть о 11:15–12:00. Питання: Який розклад сумісний з усіма умовами?",
    "difficulty": "hard",
    "score": "2.16",
    "answers": [
      {
        "text": "A) 10:00–10:45 — Y; 11:15–12:00 — X; 14:00–14:45 — Z"
      },
      {
        "text": "B) 10:00–10:45 — Y; 11:15–12:00 — Z; 14:00–14:45 — X",
        "is_correct": true
      },
      {
        "text": "C) 10:00–10:45 — Z; 11:15–12:00 — Y; 14:00–14:45 — X"
      },
      {
        "text": "D) 10:00–10:45 — Y; 11:15–12:00 — X; 14:00–14:45 — (вільно), Z перенесено"
      }
    ]
  },
  {
    "number": 27,
    "text": "Є чотири сесії: A, B, C, D, які потрібно розмістити у слотах S1, S2, S3, S4 (від раннього до пізнього). Умови: (1) B перед C; (2) A суміжно з D; (3) якщо A в S1, тоді B в S3; (4) рівно одна з пари істинна: (B в S1) XOR (D в S4); (5) C не суміжно з D; (6) якщо B безпосередньо перед C, тоді A після C. Питання: Який порядок (S1→S4) відповідає всім умовам?",
    "difficulty": "hard",
    "score": "2.16",
    "answers": [
      {
        "text": "A) A, D, B, C"
      },
      {
        "text": "B) B, D, A, C",
        "is_correct": true
      },
      {
        "text": "C) D, A, B, C"
      },
      {
        "text": "D) B, A, D, C"
      }
    ]
  },
  {
    "number": 28,
    "text": "Є 7 кандидатів: Аліса (A), Богдан (B), Христина (C), Дмитро (D), Олена (E), Федір (F), Георгій (G). Потрібно обрати команду розміром 4 або 5 осіб. Умови: (1) принаймні дві жінки (A, C, E); (2) рівно одна з пари (A, F) у складі (XOR); (3) C та E — або обидві в команді, або обидві поза нею; (4) B і D не можуть бути разом; (5) якщо G у складі, тоді розмір команди = 5; (6) якщо D відсутній, тоді B обов’язково присутній; (7) якщо C у складі, тоді F поза складом; (8) якщо A у складі, тоді G поза складом; (9) якщо C у складі, тоді B обов’язково у складі. Питання: Який склад відповідає всім умовам?",
    "difficulty": "hard",
    "score": "2.16",
    "answers": [
      {
        "text": "A) Аліса, Богдан, Христина, Олена",
        "is_correct": true
      },
      {
        "text": "B) Аліса, Христина, Дмитро, Олена"
      },
      {
        "text": "C) Аліса, Богдан, Христина, Олена, Георгій"
      },
      {
        "text": "D) Аліса, Христина, Дмитро, Олена, Георгій"
      }
    ]
  },
  {
    "number": 29,
    "text": "Твердження: 1.Усі викладачі університету є науковцями. 2.Деякі науковці не є керівниками проєктів. 3.Жоден керівник кафедри не є викладачем університету. 4.Усі керівники кафедр є керівниками проєктів. Питання: Який висновок логічно випливає з тверджень 1–4?",
    "difficulty": "medium",
    "score": "1.55",
    "answers": [
      {
        "text": "A) Деякі науковці не є керівниками кафедр."
      },
      {
        "text": "B) Жоден викладач не є керівником проєктів."
      },
      {
        "text": "C) Деякі керівники проєктів не є науковцями.",
        "is_correct": true
      },
      {
        "text": "D) Усі керівники кафедр є викладачами університету."
      }
    ]
  },
  {
    "number": 30,
    "text": "Правила: 1.Якщо кандидат має досвід у логіці, то з двох тестів — теорії множин і теорії графів — він склав рівно один: або множини, або графи, але не обидва разом. 2.Якщо кандидат склав тест із теорії графів, то інтерв’ю він не провалив. 3.Якщо кандидат провалив інтерв’ю, то він не має досвіду у логіці. 4.Якщо кандидат не провалив інтерв’ю, то тест із теорії множин він не склав. 5.Відомо, що кандидат має досвід у логіці. Питання: що обов’язково істинне?",
    "difficulty": "medium",
    "score": "1.55",
    "answers": [
      {
        "text": "A) Кандидат склав обидва тести — і з теорії множин, і з теорії графів."
      },
      {
        "text": "B) Кандидат склав тест із теорії графів.",
        "is_correct": true
      },
      {
        "text": "C) Кандидат провалив інтерв’ю"
      },
      {
        "text": "D) Кандидат не склав жодного з двох тестів."
      }
    ]
  }
]